PiChampion/PowerLineDataAquisitionDevice/board/pin_mux.c
                     /* Drive Strength Enable: Low drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_LowDriveStrength));

    /* PORTB10 (pin 58) is configured as PTB10 */
    PORT_SetPinMux(BOARD_Green_LED_PORT, BOARD_Green_LED_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 55) is configured as ADC0_SE12 */
    PORT_SetPinMux(BOARD_ADC0_SE12_PORT, BOARD_ADC0_SE12_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB23 (pin 69) is configured as PTB23 */
    PORT_SetPinMux(BOARD_Red_LED_PORT, BOARD_Red_LED_PIN, kPORT_MuxAsGpio);

    /* PORTB9 (pin 57) is configured as PTB9 */
    PORT_SetPinMux(BOARD_Yellow_LED_PORT, BOARD_Yellow_LED_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 70) is configured as PTC0 */
    PORT_SetPinMux(BOARD_LED_Button_PORT, BOARD_LED_Button_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC0 (pin 70): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_LED_Button_PORT, BOARD_LED_Button_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[0] = ((PORTC->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC1 (pin 71) is configured as ADC0_SE15 */
    PORT_SetPinMux(PORTC, 1U, kPORT_PinDisabledOrAnalog);

    /* PORTC7 (pin 79) is configured as CMP0_IN1 */
    PORT_SetPinMux(BOARD_CMP0_IN1_PORT, BOARD_CMP0_IN1_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTD0 (pin 93) is configured as PTD0 */
    PORT_SetPinMux(BOARD_Testing_Button_PORT, BOARD_Testing_Button_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD0 (pin 93): Interrupt on either edge */
    PORT_SetPinInterruptConfig(BOARD_Testing_Button_PORT, BOARD_Testing_Button_PIN, kPORT_InterruptEitherEdge);

    PORTD->PCR[0] = ((PORTD->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    PORT_SetPinMux(PORTB, PIN16_IDX, kPORT_MuxAlt3);           /* PORTB16 (pin 62) is configured as UART0_RX */
      PORT_SetPinMux(PORTB, PIN17_IDX, kPORT_MuxAlt3);           /* PORTB17 (pin 63) is configured as UART0_TX */
      const port_pin_config_t porte0_pin1_config = {
        kPORT_PullUp,                                            /* Internal pull-up resistor is enabled */
        kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
        kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
        kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
        kPORT_HighDriveStrength,                                 /* High drive strength is configured */
        kPORT_MuxAlt4,                                           /* Pin is configured as SDHC0_D1 */
        kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
      };
      PORT_SetPinConfig(PORTE, PIN0_IDX, &porte0_pin1_config);   /* PORTE0 (pin 1) is configured as SDHC0_D1 */
      const port_pin_config_t porte1_pin2_config = {
        kPORT_PullUp,                                            /* Internal pull-up resistor is enabled */
        kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
        kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
        kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
        kPORT_HighDriveStrength,                                 /* High drive strength is configured */
        kPORT_MuxAlt4,                                           /* Pin is configured as SDHC0_D0 */
        kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
      };
      PORT_SetPinConfig(PORTE, PIN1_IDX, &porte1_pin2_config);   /* PORTE1 (pin 2) is configured as SDHC0_D0 */
      const port_pin_config_t porte2_pin3_config = {
        kPORT_PullUp,                                            /* Internal pull-up resistor is enabled */
        kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
        kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
        kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
        kPORT_HighDriveStrength,                                 /* High drive strength is configured */
        kPORT_MuxAlt4,                                           /* Pin is configured as SDHC0_DCLK */
        kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
      };
      PORT_SetPinConfig(PORTE, PIN2_IDX, &porte2_pin3_config);   /* PORTE2 (pin 3) is configured as SDHC0_DCLK */
      const port_pin_config_t porte3_pin4_config = {
        kPORT_PullUp,                                            /* Internal pull-up resistor is enabled */
        kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
        kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
        kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
        kPORT_HighDriveStrength,                                 /* High drive strength is configured */
        kPORT_MuxAlt4,                                           /* Pin is configured as SDHC0_CMD */
        kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
      };
      PORT_SetPinConfig(PORTE, PIN3_IDX, &porte3_pin4_config);   /* PORTE3 (pin 4) is configured as SDHC0_CMD */
      const port_pin_config_t porte4_pin5_config = {
        kPORT_PullUp,                                            /* Internal pull-up resistor is enabled */
        kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
        kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
        kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
        kPORT_HighDriveStrength,                                 /* High drive strength is configured */
        kPORT_MuxAlt4,                                           /* Pin is configured as SDHC0_D3 */
        kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
      };
      PORT_SetPinConfig(PORTE, PIN4_IDX, &porte4_pin5_config);   /* PORTE4 (pin 5) is configured as SDHC0_D3 */
      const port_pin_config_t porte5_pin6_config = {
        kPORT_PullUp,                                            /* Internal pull-up resistor is enabled */
        kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
        kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
        kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
        kPORT_HighDriveStrength,                                 /* High drive strength is configured */
        kPORT_MuxAlt4,                                           /* Pin is configured as SDHC0_D2 */
        kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
      };
      PORT_SetPinConfig(PORTE, PIN5_IDX, &porte5_pin6_config);   /* PORTE5 (pin 6) is configured as SDHC0_D2 */
      const port_pin_config_t porte6_pin7_config = {
        kPORT_PullDown,                                          /* Internal pull-down resistor is enabled */
        kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
        kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
        kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
        kPORT_LowDriveStrength,                                  /* Low drive strength is configured */
        kPORT_MuxAsGpio,                                         /* Pin is configured as PTE6 */
        kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
      };
      PORT_SetPinConfig(PORTE, PIN6_IDX, &porte6_pin7_config);   /* PORTE6 (pin 7) is configured as PTE6 */
      SIM->SOPT5 = ((SIM->SOPT5 &
        (~(SIM_SOPT5_UART0TXSRC_MASK)))                          /* Mask bits to zero which are setting */
          | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX)       /* UART 0 transmit data source select: UART0_TX pin */
        );
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitButtonsPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '78', peripheral: GPIOC, signal: 'GPIO, 6', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/I2S0_RX_BCLK/FB_AD9/I2S0_MCLK, identifier: SW2,
    direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: up, pull_enable: enable,
    passive_filter: disable}
  - {pin_num: '38', peripheral: GPIOA, signal: 'GPIO, 4', pin_signal: PTA4/LLWU_P3/FTM0_CH1/NMI_b/EZP_CS_b, direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

